OpenFOAM_Examples/Quasi_DNS_Dowtherm_Mixed_Conv/stable_IDDESCase11_RANS_mesh/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        tolerance       0;
        relTol          0.1;
        smoother        GaussSeidel;
    }

    pFinal
    {
        $p;
        smoother        DICGaussSeidel;
        tolerance       1e-05;
        relTol          0;
    }


    p_rgh
    {
        solver           GAMG;
        tolerance        1e-5;
        relTol           0.01;

        smoother         DICGaussSeidel;

    }


    p_rghFinal
    {
        $p_rgh;
        relTol          0;
    }

    "(U|h|e|k|epsilon|omega|R|rho)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-5;
        relTol          0.1;
    }

    "(U|h|e|k|epsilon|omega|R|rho)Final"
    {
        $U;
        relTol          0;
    }
}

PIMPLE
{
    momentumPredictor yes;
    nOuterCorrectors 1000;
    nCorrectors     3;
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       1e5;
        residualControl
    {
        U
        {
                tolerance  1e-3;
                relTol      0;
        }
        p
        {
                tolerance  5e-2;
                relTol      0;
        }
     }


}

relaxationFactors
{
    nuTilda         0.7;
    "(U|h|e|k|epsilon|omega|R|rho)"               0.7;

    ".*Final"        1.0;
}


// ************************************************************************* //
